Revit.AnalysisDisplay.FaceAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Analysis.ISurfaceAnalysisData{Autodesk.DesignScript.Geometry.UV,System.Double}},System.String,System.String,System.Type)
view:
data:

Revit.AnalysisDisplay.FaceAnalysisDisplay.InternalSetSpatialFieldValues(System.Int32,Analysis.ISurfaceAnalysisData{Autodesk.DesignScript.Geometry.UV,System.Double},System.String,System.String,System.Type)
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
primitiveId:
data:

Revit.AnalysisDisplay.FaceAnalysisDisplay.ByViewAndFaceAnalysisData(Revit.Elements.Views.View,Analysis.DataTypes.SurfaceAnalysisData[],System.String,System.String,System.Type)
Show a colored Face Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
data: A collection of SurfaceAnalysisData objects.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: A FaceAnalysisDisplay object.